erp3l/src/Catalogs/РасширенияПанелиНалоговогоМониторинга/РасширенияПанелиНалоговогоМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РасширенияПанелиНалоговогоМониторинга</name>
  <predefined>
    <items>
      <name>КонтрольныеСоотношенияНП</name>
      <description>Контрольные соотношения по налогу на прибыль</description>
    </items>
    <items>
      <name>КонтрольныеСоотношенияНДС</name>
      <description>Контрольные соотношения по НДС</description>
    </items>
    <items>
      <name>РискиНалоговойПроверки</name>
      <description>Риски налоговой проверки</description>
    </items>
  </predefined>
  <attributes>
    <name>АлгоритмОпределенияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмОпределенияСтатусаНаКлиенте</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмРасшифровки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/РасширенияПанелиНалоговогоМониторинга/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АлгоритмОпределенияСтатуса.УстановитьТекст(Объект.АлгоритмОпределенияСтатуса);
	АлгоритмОпределенияСтатусаНаКлиенте.УстановитьТекст(Объект.АлгоритмОпределенияСтатусаНаКлиенте);
	АлгоритмРасшифровки.УстановитьТекст(Объект.АлгоритмРасшифровки);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.АлгоритмОпределенияСтатуса = АлгоритмОпределенияСтатуса.ПолучитьТекст();
	Объект.АлгоритмОпределенияСтатусаНаКлиенте = АлгоритмОпределенияСтатусаНаКлиенте.ПолучитьТекст();
	Объект.АлгоритмРасшифровки = АлгоритмРасшифровки.ПолучитьТекст();
КонецПроцедуры
